roncarr880/CO-Detector-Hack/p16F883.h
/* declare registers for C and define device */

#pragma pic 0
/*;-----Bank0------------------*/
char INDF  ; /*           EQU  H'0000'    */
char TMR0   ; /*             EQU  H'0001'    */
char PCL     ; /*            EQU  H'0002'    */
char STATUS ; /*             EQU  H'0003'    */
char FSR   ; /*              EQU  H'0004'    */
char PORTA ; /*              EQU  H'0005'    */
char PORTB ; /*              EQU  H'0006'    */
char PORTC ; /*              EQU  H'0007'    */
#pragma pic 9
char PORTE;
#pragma pic 10
char PCLATH ; /*             EQU  H'000A'    */
char INTCON ; /*             EQU  H'000B'    */
char PIR1  ; /*              EQU  H'000C'    */
char PIR2  ; /*              EQU  H'000D'    */
char TMR1L ; /*              EQU  H'000E'    */
char TMR1H ; /*              EQU  H'000F'    */
char T1CON ; /*              EQU  H'0010'    */
char TMR2 ; /*               EQU  H'0011'    */
char T2CON ; /*              EQU  H'0012'    */
char SSPBUF ; /*             EQU  H'0013'    */
char SSPCON ; /*             EQU  H'0014'    */
char CCPR1L ; /*             EQU  H'0015'    */
char CCPR1H ; /*             EQU  H'0016'    */
char CCP1CON  ; /*           EQU  H'0017'    */
char RCSTA   ; /*            EQU  H'0018'    */
char TXREG  ; /*             EQU  H'0019'    */
char RCREG ; /*              EQU  H'001A'    */
char CCPR2L;
char CCPR2H;
char CCP2CON ; /*             EQU  H'001D'    */
char ADRESH ; /*             EQU  H'001E'    */
char ADCON0 ; /*             EQU  H'001F'    */

/*;-----Bank1------------------*/
#pragma pic  129
char OPTION_REG ; /*         EQU  H'0081'    */
#pragma pic  133
char TRISA  ; /*             EQU  H'0085'    */
char TRISB  ; /*             EQU  H'0086'    */
char TRISC  ; /*             EQU  H'0087'    */
#pragma pic  137
char TRISE ;
#pragma pic  140
char PIE1  ; /*              EQU  H'008C'    */
char PIE2  ; /*              EQU  H'008D'    */
char PCON  ; /*              EQU  H'008E'    */
char OSCCON ; /*             EQU  H'008F'    */
char OSCTUNE ; /*            EQU  H'0090'    */
char SSPCON2;
char PR2   ; /*              EQU  H'0092'    */
/*char MSK              EQU  H'0093'*/
/*char SSPADD  ;             EQU  H'0093'    */
char SSPMSK  ; /*            EQU  H'0093'    */
char SSPSTAT  ; /*           EQU  H'0094'    */
/*char WPU              EQU  H'0095'*/
char WPUB   ; /*             EQU  H'0095'    */
/*char IOC              EQU  H'0096'*/
char IOCB   ; /*             EQU  H'0096'    */
char VRCON ; /*             EQU  H'0097'    */
char TXSTA ; /*              EQU  H'0098'    */
char SPBRG  ; /*             EQU  H'0099'    */
char SPBRGH ; /*             EQU  H'009A'    */
char PWM1CON ; /*            EQU  H'009B'    */
char ECCPAS;
char PSTRCON;
char ADRESL ; /*             EQU  H'009E'    */
char ADCON1 ; /*             EQU  H'009F'    */

/*;-----Bank2------------------*/
#pragma pic  261
char WDTCON ;
#pragma pic  263
char CM1CON0 ;
char CM2CON0 ;
char CM2CON1 ;
#pragma pic  268
char EEDATA  ; /*            EQU  H'010C'    */
char EEADR   ; /*            EQU  H'010D'    */
char EEDATH  ; /*            EQU  H'010E'    */
char EEADRH  ; /*            EQU  H'010F'    */


/*;-----Bank3------------------*/
#pragma pic   389
char SRCON ;  
#pragma pic   391
char BAUDCTL ;
char ANSEL   ;
char ANSELH  ;
#pragma pic   396
char EECON1   ; /*           EQU  H'018C'    */
char EECON2   ; /*           EQU  H'018D'    */

#pragma eesize 256
#pragma banksize 128
#pragma access 112 127
#pragma access 0 0
#pragma access 2 4
#pragma access 10 11
